Emacs.org
** System Identification

I often need to modify behavior based on the type of system Emacs is running on, especially if it's running on Guix.

#+begin_src emacs-lisp :tangle emacs/init.el

  ;;; ----- System Identification -----

  (defvar dw/is-termux
    (string-suffix-p "Android" (string-trim (shell-command-to-string "uname -a"))))

  (defvar dw/current-distro (or (and (eq system-type 'gnu/linux)
                                     (file-exists-p "/etc/os-release")
                                     (with-temp-buffer
                                       (insert-file-contents "/etc/os-release")
                                       (search-forward-regexp "^ID=\"?\\(.*\\)\"?$")
                                       (intern (or (match-string 1)
                                                   "unknown"))))
                                'unknown))

  (defvar dw/is-guix-system (eql dw/current-distro 'guix))

#+end_src

** Package Management

Customize package management based on the type of system Emacs is running on.

#+begin_src emacs-lisp :tangle emacs/init.el

  ;;; ----- Package Management -----

  ;; Automatically install packages (when not on Guix) but don't load
  ;; them until requested
  (setq use-package-always-ensure (not dw/is-guix-system)
        use-package-always-defer t)

#+end_src

** Configuration Management

This section is currently under development as I figure out the best pattern to use for providing customization "knobs" on the base configuration.

For now, the idea is that I provide variables and functions that can be called in machine-specific configuration files (named with the =system-name=) to customize basic configuration details and load extension modules that are needed for each machine.

#+begin_src emacs-lisp :tangle emacs/init.el

  ;;; ----- Configuration Management -----

  (defvar dw/use-config-modules '()
    "A list of module symbols to load once init.el is finished.")

  (defvar dw/common-config-modules '(dw-auth
                                     dw-chat
                                     dw-present
                                     dw-0x0
                                     dw-writing
                                     dw-workflow)
    "Configuration modules most commonly used across my machines.")

  ;; Add configuration modules to load path
  (add-to-list 'load-path '"~/.dotfiles/emacs/modules")

  ;; Load system-specific configuration
  (let ((config-path
         (format "~/.dotfiles/emacs/systems/%s.el" system-name)))
    (if (file-exists-p config-path)
        (load-file config-path)
      (message "No per-system configuration found for %s!" system-name)))

#+end_src

