Emacs.org
*** Tab Bar Appearance

Tweak the tab bar to remove some unnecessary elements and shift the =global-mode-string= there.

#+begin_src emacs-lisp :tangle emacs/init.el

  ;; Move global mode string to the tab-bar and hide tab close buttons
  (setq tab-bar-close-button-show nil
        tab-bar-separator " "
        tab-bar-format '(tab-bar-format-menu-bar
                         tab-bar-format-tabs-groups
                         tab-bar-separator
                         tab-bar-format-align-right
                         tab-bar-format-global))

  ;; Turn on the tab-bar
  (tab-bar-mode 1)

#+end_src

*** Display Time and World Clock

Time is relative, OK?

#+begin_src emacs-lisp :tangle emacs/init.el

  ;; Customize time display
  (setq display-time-load-average nil
        display-time-format "%l:%M %p %b %d W%U"
        display-time-world-time-format "%a, %d %b %I:%M %p %Z"
        display-time-world-list
        '(("Etc/UTC" "UTC")
          ("Europe/Athens" "Athens")
          ("America/Los_Angeles" "Seattle")
          ("America/Denver" "Denver")
          ("America/New_York" "New York")
          ("Pacific/Auckland" "Auckland")
          ("Asia/Shanghai" "Shanghai")
          ("Asia/Kolkata" "Hyderabad")))

#+end_src

** Emacs Daemon

I find it easier to just run the main Emacs instance as a daemon using =server-start=.  This enables external programs to drive my Emacs session with =emacsclient=.

#+begin_src emacs-lisp

  (server-start)

#+end_src

** Send Special Buffers to a Popup Window

Here's another minimal implementation of a package I commonly use called [[https://github.com/karthink/popper][popper.el]].  The goal here is to automatically place a specific set of buffers into a popup window at the bottom of the frame and make that window togglable with a key binding.

I don't currently support buffer cycling like =popper= does but I don't /think/ I used it that much to begin with.

#+begin_src emacs-lisp :tangle emacs/init.el

  ;; ----- Special Buffers as Popup Window -----

  (setq display-buffer-alist
        '(("\\*\\(shell\\|.*term\\|.*eshell\\|help\\|compilation\\|Async Shell Command\\|Occur\\|xref\\).*\\*"
          (display-buffer-reuse-window display-buffer-in-side-window)
          (side . bottom)                  ; Popups go at the bottom
          (slot . 0)                       ; Use the first slot at the bottom
          (post-command-select-window . t) ; Select the window upon display
          (window-height . 0.3))))         ; 30% of the frame height

  (defun dw/toggle-popup-window ()
    (interactive)
    (if-let ((popup-window
              (get-window-with-predicate
               (lambda (window)
                 (eq (window-parameter window 'window-side)
                     'bottom)))))

        ;; Focus the window if it is not selected, otherwise close it
        (if (eq popup-window (selected-window))
            (delete-window popup-window)
          (select-window popup-window))

      ;; Find the most recent buffer that matches the rule and show it
      ;; NOTE: This logic is somewhat risky because it makes the assumption
      ;;       that the popup rule comes first in `display-buffer-alist'.
      ;;       I chose to do this because maintaining a separate variable
      ;;       for this rule meant I had to re-evaluate 2 different forms
      ;;       to update my rule list.
      (if-let ((popup-buffer
                (seq-find (lambda (buffer)
                            (buffer-match-p (caar display-buffer-alist)
                                            (buffer-name buffer)))
                          (if (project-current)
                              (project-buffers (project-current))
                            (buffer-list (selected-frame))))))
          (display-buffer popup-buffer (cdar display-buffer-alist))
        (message "No popup buffers found."))))

  ;; TODO: This binding may need to change
  (keymap-global-set "C-c p" #'dw/toggle-popup-window)
  (with-eval-after-load 'term
    (keymap-set term-raw-map "C-c p" #'dw/toggle-popup-window))

#+end_src

** Essential Org Mode Configuration

Here are the most important Org Mode settings that enable me to edit files comfortably, especially my literate configuration files.

#+begin_src emacs-lisp :tangle emacs/init.el

  ;;; ----- Essential Org Mode Configuration -----

  (setq org-ellipsis " ▾"
        org-startup-folded 'content
        org-cycle-separator-lines 2
        org-fontify-quote-and-verse-blocks t)

  ;; Indent org-mode buffers for readability
  (add-hook 'org-mode-hook #'org-indent-mode)

  ;; Set up Org Babel languages
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (shell . t)))

  ;; Use org-tempo
  (use-package org-tempo
    :ensure nil
    :demand t
    :config
    (dolist (item '(("sh" . "src sh")
                    ("el" . "src emacs-lisp")
                    ("li" . "src lisp")
                    ("sc" . "src scheme")
                    ("ts" . "src typescript")
                    ("py" . "src python")
                    ("yaml" . "src yaml")
                    ("json" . "src json")
                    ("einit" . "src emacs-lisp :tangle emacs/init.el")
                    ("emodule" . "src emacs-lisp :tangle emacs/modules/dw-MODULE.el")))
      (add-to-list 'org-structure-template-alist item)))

#+end_src

*** Document Centering

I previously used =visual-fill-column-mode= for this functionality but decided to write my own minimal implementation so that I could avoid installing a MELPA package.

Works pretty well, but I'm not fully convinced this needs to be in =init.el=.  It certainly does make the writing experience more pleasant but may not be critical for minimal config deployments.

#+begin_src emacs-lisp :tangle emacs/init.el

  ;;; ----- Document Centering -----

  (defvar center-document-desired-width 90
    "The desired width of a document centered in the window.")

  (defun center-document--adjust-margins ()
    ;; Reset margins first before recalculating
    (set-window-parameter nil 'min-margins nil)
    (set-window-margins nil nil)

    ;; Adjust margins if the mode is on
    (when center-document-mode
      (let ((margin-width (max 0
  			     (truncate
  			      (/ (- (window-width)
  				    center-document-desired-width)
  				 2.0)))))
        (when (> margin-width 0)
  	(set-window-parameter nil 'min-margins '(0 . 0))
  	(set-window-margins nil margin-width margin-width)))))

  (define-minor-mode center-document-mode
    "Toggle centered text layout in the current buffer."
    :lighter " Centered"
    :group 'editing
    (if center-document-mode
        (add-hook 'window-configuration-change-hook #'center-document--adjust-margins 'append 'local)
      (remove-hook 'window-configuration-change-hook #'center-document--adjust-margins 'local))
    (center-document--adjust-margins))

  (add-hook 'org-mode-hook #'center-document-mode)
  (add-hook 'markdown-mode-hook #'center-document-mode)
  (add-hook 'text-mode-hook #'center-document-mode)

#+end_src

** Shells

This is a configuration for Emacs' built in shells, =term= / =ansi-term= and =eshell=.

#+begin_src emacs-lisp :tangle emacs/init.el

  ;; Coming soon.

#+end_src

** Dired

Dired doesn't need much configuration, but the following just ensures that Dired buffers are organized in a way that makes sense to me, are free from unneeded information (at first), and doesn't leave a ton of buffers open as I move around.

I also add a binding for =b= to =dired-up-directory= because it seems very strange to me that they have =f= bound to =dired-find-file= without =b= moving in the "opposite" direction.

#+begin_src emacs-lisp :tangle emacs/init.el

  ;;; ----- Dired -----

  (defun dw/dired-mode-hook ()
    (interactive)
    (dired-hide-details-mode 1)
    (hl-line-mode 1))

  (use-package dired
    :ensure nil
    :bind (:map dired-mode-map
                ("b" . dired-up-directory))
    :config
    (setq dired-listing-switches "-alv --group-directories-first"
          dired-omit-files "^\\.[^.].*"
          dired-omit-verbose nil
          dired-dwim-target 'dired-dwim-target-next
          dired-hide-details-hide-symlink-targets nil
          dired-kill-when-opening-new-dired-buffer t
          delete-by-moving-to-trash t)

    (add-hook 'dired-mode-hook #'dw/dired-mode-hook))

#+end_src

** Proced

The built-in =proced= package is quite useful for producing a list of all running processes.  It's basically like having =top= built in to Emacs.

This configuration makes the =proced= buffer update automatically on an interval so that you can watch process activity as it changes.

#+begin_src emacs-lisp

  (use-package proced
    :ensure nil
    :config
    (setq proced-auto-update-interval 1)
    (add-hook 'proced-mode-hook
              (lambda ()
                (proced-toggle-auto-update 1))))

#+end_src

** Searching

I search through files *a lot*.  Here are some tweaks to make that experience a bit faster and more convenient:

#+begin_src emacs-lisp :tangle emacs/init.el

  ;; Make sure ripgrep is used everywhere
  (setq xref-search-program 'ripgrep
        grep-command "rg -nS --noheading")

#+end_src

** Focus Mode

Sometimes you just want to focus on what you're writing.  This is a simple mode to help accomplish that.

#+begin_src emacs-lisp :tangle emacs/init.el

  (defvar focus-mode--saved-mode-line-format nil
    "Stores the `mode-line-format' value before enabling focus mode.")

  (define-minor-mode focus-mode
    "Hide unnecessary UI elements to increase focus."
    :global t
    :group 'editing
    :lighter " Focus"
    (if focus-mode
        (progn
          (setq-default focus-mode--saved-mode-line-format (default-value 'mode-line-format))
          (setq-default mode-line-format nil)
          (tab-bar-mode 0))
      (setq-default mode-line-format focus-mode--saved-mode-line-format)
      (tab-bar-mode 1)))

#+end_src

