Emacs.org
** Finalization

At the end of =init.el=, we finalize any configuration settings that may have been applied at the per-system level.  This includes loading any configuration modules that are requested.

#+begin_src emacs-lisp :tangle emacs/init.el

  ;;; ----- Finalization

  ;; Load requested configuration modules
  (dolist (module dw/use-config-modules)
    (require module))

#+end_src

* Modules

The following sections contain optional modules that will be loaded on a per-system basis depending on whether the specified features are needed.

** =dw-writing= - Writing Tools

I use [[https://protesilaos.com/emacs/denote][Denote]] as my primary tool for writing in Emacs.  It enables me to write whatever I need very efficiently without thinking too much about where the information belongs.

I also use it as the core for my personal productivity system which revolves largely around Denote-managed Org Mode notes with special file-level tags.

#+begin_src emacs-lisp :tangle emacs/modules/dw-writing.el

  ;; -*- lexical-binding: t; -*-

  (use-package denote
    :demand t
    :bind (("C-c n l" . denote-link-or-create)
           ("C-c n o" . denote-open-or-create)
           ("C-c n r" . denote-rename-file-using-front-matter))
    :custom
    (denote-directory "~/Notes")
    (denote-rename-buffer-format "Denote: %t (%k)")
    (denote-infer-keywords nil)
    (denote-known-keywords
     '("pra" "prb" "prc"
       "ply" "plm" "plw"
       "kt" "ke" "kp" "kl" "ka" "kap"
       "kcp" "kca" "kcc"
       "kra" "krb" "krv"
       "rn"))

    :config
    ;; Rename buffers with the note name
    (denote-rename-buffer-mode 1)

    ;; Buttonize all denote links in text buffers
    (add-hook 'text-mode-hook #'denote-fontify-links-mode-maybe))

  (use-package consult-notes
    :ensure nil
    :commands (consult-notes)
    :config
    (consult-notes-denote-mode 1))

  (defun dw/setup-markdown-mode ()
    (center-document-mode 1)
    (display-line-numbers-mode 0))

  (use-package markdown-mode
    :config
    (setq markdown-command "marked")
    (add-hook 'markdown-mode-hook #'dw/setup-markdown-mode)
    (dolist (face '((markdown-header-face-1 . 1.2)
                    (markdown-header-face-2 . 1.1)
                    (markdown-header-face-3 . 1.0)
                    (markdown-header-face-4 . 1.0)
                    (markdown-header-face-5 . 1.0)))
      (set-face-attribute (car face) nil :weight 'normal :height (cdr face))))

  (defun dw/orgalist-text-mode-hook ()
    (unless (derived-mode-p 'org-mode)
      (orgalist-mode 1)))

  (use-package orgalist
    :init
    (add-hook 'text-mode-hook 'dw/orgalist-text-mode-hook))

  (defun dw/howm-set-buffer-name ()
    (when (and buffer-file-name
               (howm-subdirectory-p howm-directory buffer-file-name))
      (howm-mode-set-buffer-name)))

  (use-package howm
    :ensure nil
    :bind* ("C-c ; ;" . howm-menu)
    :init
    (setq howm-prefix (kbd "C-c ;")
          howm-view-use-grep t
          howm-buffer-name-format "howm: %s"
          howm-buffer-name-limit 100
          howm-buffer-name-total-limit 100
          howm-directory "~/Notes"
          howm-keyword-file (expand-file-name ".howm-keys" howm-directory)
          howm-history-file (expand-file-name ".howm-history" howm-directory)
          howm-file-name-format "%Y/%m/%Y-%m-%d-%H%M%S.org"
          howm-view-title-header "*"
          howm-dtime-format "<%Y-%m-%d %a %H:%M>"
          howm-template "* %title%cursor\n\n%date %file\n\n")
    :config
    (add-hook 'org-mode-hook 'howm-mode)
    (add-hook 'howm-mode-hook 'dw/howm-set-buffer-name)
    (add-hook 'after-save-hook 'dw/howm-set-buffer-name)

    ;; Adapted from this GitHub issue:
    ;; https://github.com/protesilaos/modus-themes/issues/117#issuecomment-2337993946
    (modus-themes-with-colors
      (custom-set-faces
       `(howm-menu-key-face ((,c :inherit help-key-binding)))
       `(howm-mode-keyword-face (( )))
       `(howm-mode-ref-face ((,c :inherit link)))
       `(howm-mode-title-face ((,c :inherit modus-themes-heading-0)))
       `(howm-mode-wiki-face ((,c :inherit link)))
       `(howm-reminder-deadline-face ((,c :foreground ,red-warmer :underline nil)))
       `(howm-reminder-late-deadline-face ((,c :inherit bold :foreground ,date-deadline :underline nil)))
       `(howm-reminder-defer-face ((,c :foreground ,date-scheduled :underline nil)))
       `(howm-reminder-schedule-face ((,c :foreground ,date-scheduled :underline nil)))
       `(howm-reminder-done-face ((,c :foreground ,prose-done :underline nil)))
       `(howm-reminder-todo-face ((,c :foreground ,prose-todo :underline nil)))
       `(howm-reminder-normal-face ((,c :foreground ,date-common :underline nil)))
       `(howm-reminder-today-face ((,c :inherit bold :foreground ,bg-main :background ,yellow-warmer :underline nil)))
       `(howm-reminder-tomorrow-face ((,c :inherit bold :foreground ,date-scheduled :underline nil)))
       `(howm-simulate-todo-mode-line-face ((,c :inherit bold)))
       `(howm-view-empty-face (( )))
       `(howm-view-hilit-face ((,c :inherit match)))
       `(howm-view-name-face ((,c :inherit bold)))
       `(iigrep-counts-face1 ((,c :foreground ,rainbow-1)))
       `(iigrep-counts-face2 ((,c :foreground ,rainbow-2)))
       `(iigrep-counts-face3 ((,c :foreground ,rainbow-3)))
       `(iigrep-counts-face4 ((,c :foreground ,rainbow-4)))
       `(iigrep-counts-face5 ((,c :foreground ,rainbow-5))))))

  (provide 'dw-writing)

#+end_src

** =dw-workflow= - Workflow, Task, and Project Management

#+begin_src emacs-lisp :tangle emacs/modules/dw-workflow.el

  ;; -*- lexical-binding: t; -*-

  ;;; ----- TODO Configuration -----

  (setq org-todo-keywords
        '((sequence "TODO(t)" "WAIT(w)" "|" "DONE(d!)")))

  (setq org-todo-keyword-faces
        '(("GOAL" . (:foreground "orange red" :weight bold))
          ("WAIT" . (:foreground "HotPink2" :weight bold))
          ("BACK" . (:foreground "MediumPurple3" :weight bold))))

  ;;; ----- Context Tags -----

  (setq-default org-tag-alist
                '((:startgroup)
                  ("Areas")
                  (:grouptags)
                  ("@home" . ?H)
                  ("@work" . ?W)
                  (:endgroup)

                  (:startgrouptag . nil)
                  ("Contexts")
                  (:grouptags)
                  ("@computer" . ?C)
                  ("@mobile" . ?M)
                  ("@calls" . ?A)
                  ("@errands" . ?E)
                  (:endgrouptag)

                  ;; Task Types
                  (:startgrouptag . nil)
                  ("Types")
                  (:grouptags)
                  ("@easy" . ?e)
                  ("@hacking" . ?h)
                  ("@writing" . ?w)
                  ("@creative" . ?v)
                  ("@accounting" . ?a)
                  ("@email" . ?m)
                  ("@system" . ?s)
                  (:endgrouptag)

                  ;; Workflow states
                  (:startgroup . nil)
                  ("States")
                  (:grouptags)
                  ("@plan" . ?p)
                  ("@review" . ?r)
                  ("@followup" . ?f)
                  (:endgroup)))


  ;; Only make context tags inheritable (what about noexport?)
  (setq org-use-tag-inheritance "^@")

  ;;; ----- Time Tracking -----

  ;; Clock in on the current task when setting a timer
  (add-hook 'org-timer-set-hook #'org-clock-in)

  ;; Clock out of the current task when the timer is complete
  (add-hook 'org-timer-done-hook #'org-clock-out)

  ;;; ----- Agenda Configuration -----

  (defvar dw/base-agenda-files '("Inbox.org" "Schedule.org")
    "The base agenda files that will always be included.")

  (setq org-directory "~/Notes"
        org-agenda-span 'day
        org-agenda-start-with-log-mode t
        org-agenda-files dw/base-agenda-files
        org-agenda-window-setup 'current-window)

  ;; Make done tasks show up in the agenda log
  (setq org-log-done 'time
        org-log-into-drawer t)

  (defvar-keymap dw/org-key-map
    :doc "Personal Org Mode key bindings"
    "a" #'org-agenda)

  (keymap-set global-map "C-c o" dw/org-key-map)

  ;;; ----- Capture Templates -----

  (setq org-capture-templates
        '(("t" "Task" entry (file+datetree+olp "~/Notes/2025-Notes.org" "Tasks")
           "* TODO %?\n  %i\n  %a")
          ("e" "Entry" entry (file+olp+datetree "~/Notes/2025-Notes.org" "Entries")
           "* %?\nEntered on %U\n  %i\n  %a")))

  ;;; ----- Denote Integration -----

  (defun dw/refresh-agenda-files ()
    (interactive)
    (setq org-agenda-files
          (append (denote-directory-files "_pra")
                  dw/base-agenda-files)))

  (defun dw/goto-weekly-note ()
    (interactive)
    (let* ((note-title (format-time-string "%Y-W%V"))
           (existing-notes
            (denote-directory-files (format "-%s" note-title) nil t)))
      (if existing-notes
          (find-file (car existing-notes))
        (denote note-title '("plw")))))

  (with-eval-after-load 'denote
    ;; Quick access commands
    (keymap-set global-map "C-c n w" #'dw/goto-weekly-note)

    ;; Refresh agenda files the first time
    (dw/refresh-agenda-files)

    ;; Update agenda files after notes are created or renamed
    (add-hook 'denote-after-rename-file-hook #'dw/refresh-agenda-files)
    (add-hook 'denote-after-new-note-hook #'dw/refresh-agenda-files))

  (provide 'dw-workflow)

#+end_src

** =dw-develop= - Programming Configuration

*** Project Management

I'm leveraging the built-in =project.el= package to manage the tasks I perform around the projects I'm working on.

#+begin_src emacs-lisp :tangle emacs/modules/dw-develop.el

  (use-package project
    :ensure nil
    :bind (:map project-prefix-map
                ("t" . eat-project))
    :custom
    (project-switch-use-entire-map t))

  (defun dw/project-compilation-buffer-name-function (name-of-mode)
    (format "*compilation: %s*" (project-name (project-current))))

  (setq project-compilation-buffer-name-function 'dw/project-compilation-buffer-name-function)

  (defun dw/ensure-project-in-tab (project-dir)
    "Ensure we're in a tab named after the project."
    (let* ((project-name (file-name-nondirectory (directory-file-name project-dir)))
           (tab-names (mapcar (lambda (tab) (alist-get 'name tab)) (tab-bar-tabs)))
           (existing-tab (seq-find (lambda (name) (equal name project-name)) tab-names)))
      (unless existing-tab
        (tab-new)
        (tab-rename project-name))
      (unless (equal (alist-get 'name (tab-bar--current-tab)) project-name)
        (tab-bar-select-tab-by-name project-name))))

  (defun dw/project-prompter ()
    "Prompt for project and ensure it opens in the correct tab."
    (let ((project-dir (project-prompt-project-dir)))
      (dw/ensure-project-in-tab project-dir)
      project-dir))

  ;; Use our custom prompter for all project commands
  (setq project-prompter #'dw/project-prompter)

#+end_src

*** Code Formatting

#+begin_src emacs-lisp

  (use-package apheleia
    :vc (:url "https://github.com/radian-software/apheleia"
              :rev "v4.4.1")
    :init
    (apheleia-global-mode 1))

#+end_src

