emacs/init.el

;; Load requested configuration modules
(dolist (module dw/use-config-modules)
  (require module))
