emacs/modules/dw-develop.el
(use-package project
  :ensure nil
  :custom
  (project-switch-use-entire-map t))

(defun dw/project-compilation-buffer-name-function (name-of-mode)
  (format "*compilation: %s*" (project-name (project-current))))

(setq project-compilation-buffer-name-function 'dw/project-compilation-buffer-name-function)
