Emacs.org
*** Language Servers

Eglot is the way.

#+begin_src emacs-lisp :tangle emacs/modules/dw-develop.el

  (use-package eglot
    :ensure nil
    :hook ((js-mode
            typescript-mode) . eglot-ensure))

#+end_src

*** JavaScript / TypeScript

#+begin_src emacs-lisp :tangle emacs/modules/dw-develop.el

  (use-package js-mode
    :ensure nil
    :config
    (setq-default js-indent-level 2))

  (use-package typescript-mode
    :mode ("\\.tsx?\\'")
    :config
    (setq-default typescript-indent-level 2))

#+end_src

*** Janet

[[https://janet-lang.org][Janet]] is probably my second-favorite language for project hacking right now.

#+begin_src emacs-lisp :tangle emacs/modules/dw-develop.el

  (use-package janet-mode)

#+end_src

*** Provide =dw-develop=

Finish up by providing the feature.

#+begin_src emacs-lisp :tangle emacs/modules/dw-develop.el

  (provide 'dw-develop)

#+end_src

*** Docker

#+begin_src emacs-lisp

  (use-package dockerfile-mode)

#+end_src

** =dw-present= - Presentations and Live Streaming

I'm planning to develop a new presentation configuration using Prot's Logos package because it's a bit more flexible and will enable me to treat code files as presentations in addition to Org files and pretty much any other type of file that has syntax that can be interpreted as a page marker (like a comment string).

#+begin_src emacs-lisp :tangle emacs/modules/dw-present.el

  ;; -*- lexical-binding: t; -*-

  (defun dw/present-prepare-slide ()
    (when (and logos-focus-mode
               (derived-mode-p 'org-mode))
      (org-overview)
      (org-show-entry)
      (org-show-children)))

  (defun dw/present-toggle ()
    "Configures the buffer for a presentation."
    (interactive)
    (if logos-focus-mode
        (progn
          (setq-local face-remapping-alist nil)
          (widen)
          (logos-focus-mode 0))

      (setq-local face-remapping-alist '((default (:height 1.5) default)
                                         (org-document-title (:height 1.75) org-document-title)
                                         (org-block-begin-line (:height 0.7) org-block)))

      ;; Narrow the buffer and start focus mode
      (logos-narrow-dwim)
      (logos-focus-mode 1)

      ;; Prepare the slide
      (dw/present-prepare-slide)))

  (use-package logos
    :bind (([remap narrow-to-region] . logos-narrow-dwim)
  	       ([remap forward-page] . logos-forward-page-dwim)
           ([remap backward-page] . logos-backward-page-dwim))
    :custom
    (logos-outlines-are-pages t)
    (logos-scroll-lock t)
    :config
    (setf (alist-get 'org-mode logos-outline-regexp-alist) "^\\*\\{1,2\\} +")
    (add-hook 'logos-page-motion-hook #'dw/present-prepare-slide))

  (provide 'dw-present)

#+end_src

** =dw-chat= - IRC and XMPP Configuration

I prefer =rcirc= as my default IRC client, it's simple and gets the job done.  I've mainly moved to using an XMPP server with biboumi as an IRC bridge, though.

#+begin_src emacs-lisp :tangle emacs/modules/dw-chat.el

  ;; -*- lexical-binding: t; -*-

  (use-package rcirc
    :ensure nil
    :custom
    (rcirc-default-nick "daviwil")
    (rcirc-default-user-name "daviwil")
    (rcirc-default-full-name "David Wilson")
    (rcirc-server-alist `(("chat.sr.ht"
                           :port 6697
                           :encryption tls
                           :user-name "daviwil/irc.libera.chat@emacs")))

    (rcirc-reconnect-delay 5)
    (rcirc-fill-column 90)
    (rcirc-track-ignore-server-buffer-flag t)

    :config
    ;; Annoy me, please
    (rcirc-track-minor-mode 1)

    ;; See: https://idiomdrottning.org/rcirc-soju
    (defun-rcirc-command detach (channel)
      "Detach channel to soju."
      (interactive "sPart channel: ")
      (let ((channel (if (> (length channel) 0) channel target)))
        (rcirc-send-privmsg
         process "BouncerServ"
         (format
          "channel update %s -detached true -reattach-on highlight" channel)))))

  (use-package jabber
    :custom
    (jabber-chat-buffer-format "Jabber: %n")
    :config
    ;; Unset the global key binding
    (global-set-key (kbd "C-x C-j") #'dired-jump))

  (provide 'dw-chat)

#+end_src


** =dw-0x0= - Share Text and Files with 0x0.st

The =0x0.el= package is really useful and I used it for a long time.  However, it's currently only on MELPA and I really only use a couple of the functions it provides.

Here's my own minimal implementation from scratch, please feel free to copy into your own config!

#+begin_src emacs-lisp :tangle emacs/modules/dw-0x0.el

  ;; -*- lexical-binding: t; -*-

  (defun dw/0x0-upload-text ()
    (interactive)
    (let* ((contents (if (use-region-p)
  		       (buffer-substring-no-properties (region-beginning) (region-end))
  		     (buffer-string)))
  	 (temp-file (make-temp-file "0x0" nil ".txt" contents)))
      (message "Sending %s to 0x0.st..." temp-file)
      (let ((url (string-trim-right
  		(shell-command-to-string
  		 (format "curl -s -F'file=@%s' https://0x0.st" temp-file)))))
        (message "The URL is %s" url)
        (kill-new url)
        (delete-file temp-file))))

  (defun dw/0x0-upload-file (file-path)
    (interactive "fSelect a file to upload: ")
    (message "Sending %s to 0x0.st..." file-path)
    (let ((url (string-trim-right
  	      (shell-command-to-string
  	       (format "curl -s -F'file=@%s' https://0x0.st" (expand-file-name file-path))))))
      (message "The URL is %s" url)
      (kill-new url)))

  (provide 'dw-0x0)

#+end_src

** =dw-telegram= - telega.el configuration

#+begin_src emacs-lisp :tangle emacs/modules/dw-telegram.el

  ;; -*- lexical-binding: t; -*-

  (use-package tracking
    :demand t)

  (use-package telega
    :commands telega
    :config
    (setq telega-use-tracking-for '(or unmuted mention)
          telega-completing-read-function #'completing-read
          telega-msg-rainbow-title t
          telega-chat-fill-column 75)

    ;; Show notifications in the mode line
    (add-hook 'telega-load-hook #'telega-mode-line-hook)

    ;; Disable chat buffer auto-fill
    (add-hook 'telega-chat-mode-hook #'telega-chat-auto-fill-mode)

    (when (eq dw/current-distro 'void)
      (setq telega-server-libs-prefix "/usr")))

  (provide 'dw-telegram)

#+end_src

** =dw-desktop= - Desktop Environment Utilities

When used as part of a desktop environment, here are some packages that will make it easier for Emacs to drive most of the experience.

#+begin_src emacs-lisp :tangle emacs/modules/dw-desktop.el

  ;; -*- lexical-binding: t; -*-

  ;; Integrate with the system clipboard
  (unless (display-graphic-p)
    (use-package xclip
      :demand t
      :config
      (xclip-mode 1)))

  ;; Pull in $PATH from the shell environment
  (use-package exec-path-from-shell
    :init
    (exec-path-from-shell-initialize))

  (use-package bluetooth)
  ;;  :commands (bluetooth-list-devices))

  ;; Control NetworkManager via nmcli
  (use-package nm
    :vc (:url "https://github.com/Kodkollektivet/emacs-nm"
         :rev :newest))

  (use-package inf-mongo
    :vc (:url "https://github.com/endofunky/inf-mongo"
         :rev :newest))

  (provide 'dw-desktop)

#+end_src

** =dw-auth= - Authentication Utilities

I use GPG primarily when authenticating with Git remotes or opening =pass= entries.  =pinentry= is the tool that enables me to prompt for my GPG passphrase inside of Emacs.

=auth-source-pass= enables the use of =pass= entries for automatically loading credentials for certain things like my IRC bouncer password.

#+begin_src emacs-lisp :tangle emacs/modules/dw-auth.el

  ;; -*- lexical-binding: t; -*-

  ;; Use `pass` as an auth-source
  (when (file-exists-p "~/.password-store")
    (auth-source-pass-enable))

  ;; Enable GPG passphrase entry
  (use-package pinentry
    :demand t
    :config
    (pinentry-start))

  (provide 'dw-auth)

#+end_src

** =dw-mail= - Reading and sending e-mail

#+begin_src emacs-lisp :tangle emacs/modules/dw-mail.el

  (use-package gnus
    :ensure nil
    :config
    (setq gnus-select-method '(nnnil ""))
    (setq gnus-secondary-select-methods
          '((nnimap "fastmail"
             (nnimap-address "imap.fastmail.com")
             (nnir-search-engine imap)

             ;; Move expired mail items to the trash immediately
             (nnmail-expiry-target "nnimap+fastmail:Trash")
             (nnmail-expiry-wait immediate))
            (nntp "gwene" (nntp-address "news.gwene.org"))
            (nntp "news.yhetil.org")))

    (add-hook 'gnus-after-getting-new-news-hook 'gnus-notifications)

    (require 'gnus-demon)
    (setq gnus-demon-handlers
          '((gnus-demon-scan-news t 60)
            (gnus-demon-scan-mail t 60)))
    (gnus-demon-init))

  (provide 'dw-mail)

#+end_src

** =dw-system= - System management with Guix

The =emacs-guix= package is quite convenient for searching Guix packages from within Emacs.  I've started running my config application scripts using =async-shell-command= so I've included a command to make that more convenient.

#+begin_src emacs-lisp :tangle emacs/modules/dw-system.el

  ;; -*- lexical-binding: t; -*-

  (defun dw/guix-update-channels ()
    (interactive)
    (async-shell-command "~/.dotfiles/.files/.bin/update-channels" "*guix-channel-update*"))

  (defun dw/guix-update-system ()
    (interactive)
    (async-shell-command "~/.dotfiles/.files/.bin/update-system" "*guix-system-update*"))

  (use-package guix
    :ensure nil
    :if dw/is-guix-system
    :bind (("C-c G p" . guix-packages-by-name)
           ("C-c G u c" . dw/guix-update-channels)
           ("C-c G u s" . dw/guix-update-system)))

  (provide 'dw-system)

#+end_src

** =dw-shell= - Shell enhancements

This module uses =xterm-color= to improve ANSI escape handling in eshell and =M-x compile= so that colors and other terminal behavior comes through correctly.

#+begin_src emacs-lisp :tangle emacs/modules/dw-system.el

  ;; -*- lexical-binding: t; -*-
  (use-package xterm-color
    :ensure nil  ; Not available on ELPA repos
    :config
    ;; Enable ANSI escape handling in eshell
    (with-eval-after-load 'eshell
      (add-hook 'eshell-before-prompt-hook
                (lambda ()
                  (setq xterm-color-preserve-properties t)))

      (add-to-list 'eshell-preoutput-filter-functions 'xterm-color-filter)
      (setq eshell-output-filter-functions (remove 'eshell-handle-ansi-color eshell-output-filter-functions))
      (setenv "TERM" "xterm-256color"))

    ;; Enable ANSI escape handling in M-x compile
    (setq compilation-environment '("TERM=xterm-256color"))

    (defun dw/advice-compilation-filter (f proc string)
      (funcall f proc (xterm-color-filter string)))

    (advice-add 'compilation-filter :around #'dw/advice-compilation-filter))

  (use-package eat
    :config
    (add-hook 'eshell-load-hook #'eat-eshell-mode))

#+end_src

