Emacs.org
** =dw-ai= - Artifical Intelligence Tools

I've been using Claude Code lately to assist with writing tools to enhance my workflow in certain areas.  These packages make it easier to interact with Claude Code in Emacs.

#+begin_src emacs-lisp :tangle emacs/modules/dw-ai.el

  ;; Monet adds some nice integrations into Emacs, like in-editor diffs
  ;; of proposed changes and editor context shared when sending prompts

  (use-package monet
    :vc (:url "https://github.com/stevemolitor/monet" :rev :newest))

  ;; NOTE: This will take a while due to massive GIFs in the repo!
  (use-package claude-code
    :ensure t
    :vc (:url "https://github.com/stevemolitor/claude-code.el" :rev :newest)
    :bind-keymap ("C-c c" . claude-code-command-map)
    :bind  (:repeat-map my-claude-code-map
                        ("M" . claude-code-cycle-mode))
    :config
    (add-hook 'claude-code-process-environment-functions #'monet-start-server-function)
    (monet-mode 1)
    (claude-code-mode))

  (provide 'dw-ai)

#+end_src

* Machine-Specific Settings

This section contains settings that are specific to various systems, particularly to choose extension modules to be loaded on top of the base configuration.

** zerocool

Guix 🐃

#+begin_src emacs-lisp :tangle emacs/systems/zerocool.el

  (setq dw/use-config-modules
   (append dw/common-config-modules
           '(dw-desktop
             dw-system
             dw-develop
             dw-telegram
             dw-mail
             dw-ai)))

#+end_src

** phantom

Guix 🐃

#+begin_src emacs-lisp :tangle emacs/systems/phantom.el

  (setq dw/use-config-modules
   (append dw/common-config-modules
           '(dw-desktop
             dw-system)))

#+end_src

** daviwil-x1e

Windows 🤮

#+begin_src emacs-lisp :tangle emacs/systems/daviwil-x1e.el

  (setq dw/use-config-modules dw/common-config-modules)
  (setq xclip-method 'powershell)

#+end_src

** cereal

macOS 🤮

#+begin_src emacs-lisp :tangle emacs/systems/cereal.el

  (setq dw/use-config-modules
   (append dw/common-config-modules
           '(dw-desktop
             dw-system
             dw-develop
             dw-ai)))

  ;; Treat Command as Ctrl inside of Emacs (because I remap Ctrl to Command)
  (setq ns-command-modifier 'meta)

  ;; Use the traditional approach to setting alpha on macOS
  (set-frame-parameter (selected-frame) 'alpha 93)
  (add-to-list 'default-frame-alist '(alpha . 93))

  ;; Use ls from coreutils in Dired
  (setq insert-directory-program "gls"
        dired-use-ls-dired t)

  ;; Adjust font sizes
  ;; TODO: Use defvars instead
  (add-hook 'after-init-hook
            (lambda ()
              (set-face-attribute 'default nil :height 166)
              (set-face-attribute 'fixed-pitch nil :height 166)
              (set-face-attribute 'variable-pitch nil :height 146)))

#+end_src
